[
  {
    "Spanish": "Tres",
    "Enhanced_Notes": "Cultural Context: Used for counting, ordering (third), measurements, and time expressions.\n\nExample 1: Nos vemos a las tres. = We'll meet at three.\nExample 2: Somos tres personas en total. = We are three people in total.\nExample 3: Dame tres empanadas por favor. = Give me three empanadas please.\n\nFormality: Neutral\nUsage Notes: Essential for everyday transactions in Colombian tiendas and restaurants."
  },
  {
    "Spanish": "Uno",
    "Enhanced_Notes": "Cultural Context: Used for counting, ordering (first), or expressing singularity. In Colombian Spanish, \"uno\" is also used informally to mean \"one\" (oneself).\n\nExample 1: Dame uno por favor. = Give me one please.\nExample 2: Soy el número uno en la fila. = I'm number one in line.\nExample 3: Uno no sabe qué hacer en estas situaciones. = One doesn't know what to do in these situations.\n\nFormality: Neutral\nUsage Notes: In Colombia, \"uno\" as an impersonal pronoun is very common in everyday speech."
  },
  {
    "Spanish": "Vamos a hablar.",
    "Enhanced_Notes": "Cultural Context: Used to initiate a conversation or suggest having a talk. Can be casual or serious depending on tone.\n\nExample 1: Vamos a hablar sobre el proyecto. = Let's talk about the project.\nExample 2: Necesitamos hablar. Vamos a hablar después del almuerzo. = We need to talk. Let's talk after lunch.\nExample 3: Vamos a hablar claro sobre esto. = Let's speak clearly about this.\n\nFormality: Neutral to Informal\nUsage Notes: Common in Colombian workplaces and personal relationships to set up discussions."
  },
  {
    "Spanish": "Vamos a ver.",
    "Enhanced_Notes": "Cultural Context: Colombian expression meaning \"let's see\" or \"we'll see\" - used for uncertainty, planning, or before checking something.\n\nExample 1: ¿Puedes venir mañana? - Vamos a ver, te confirmo. = Can you come tomorrow? - Let's see, I'll confirm.\nExample 2: Vamos a ver si está abierto el almacén. = Let's see if the store is open.\nExample 3: Vamos a ver qué pasa. = We'll see what happens.\n\nFormality: Informal to Neutral\nUsage Notes: Extremely common in Colombian Spanish for non-committal responses or when checking something."
  },
  {
    "Spanish": "Veinte",
    "Enhanced_Notes": "Cultural Context: Used for counting, prices (common in Colombian pesos), and addresses.\n\nExample 1: La Calle Veinte con Carrera Quince. = 20th Street with 15th Avenue.\nExample 2: Me cuesta veinte mil pesos. = It costs me twenty thousand pesos.\nExample 3: Tengo veinte años. = I'm twenty years old.\n\nFormality: Neutral\nUsage Notes: Very common in Colombian addresses (calles and carreras) and discussing prices."
  },
  {
    "Spanish": "Voy a salir.",
    "Enhanced_Notes": "Cultural Context: Announcement that you're going out or leaving soon. Very common in Colombian households and workplaces.\n\nExample 1: Voy a salir un rato, ya vuelvo. = I'm going out for a bit, I'll be back.\nExample 2: Voy a salir a comprar el pan. = I'm going out to buy bread.\nExample 3: Me tengo que ir, voy a salir. = I have to go, I'm going out.\n\nFormality: Informal to Neutral\nUsage Notes: Often used to announce departure to family or colleagues in Colombia."
  },
  {
    "Spanish": "Voy a {{comer}}.",
    "Enhanced_Notes": "Frame: Ir a + infinitive\n\nCultural Context: Future construction \"ir a + infinitive\" - most common way to express future in Colombian Spanish.\n\nExample 1: Voy a comer en una hora. = I'm going to eat in an hour.\nExample 2: Voy a estudiar esta noche. = I'm going to study tonight.\nExample 3: ¿Qué vas a hacer mañana? = What are you going to do tomorrow?\n\nFormality: Neutral\nUsage Notes: This construction is preferred over future tense in everyday Colombian speech. Pattern: ir (conjugated) + a + infinitive."
  },
  {
    "Spanish": "Voy saliendo",
    "Enhanced_Notes": "Cultural Context: Progressive form meaning \"I'm leaving now\" or \"I'm on my way out\" - indicates action in progress.\n\nExample 1: ¿Dónde estás? - Voy saliendo de la casa. = Where are you? - I'm leaving the house now.\nExample 2: Ya voy saliendo, llego en diez minutos. = I'm leaving now, I'll arrive in ten minutes.\nExample 3: Voy saliendo del trabajo. = I'm leaving work now.\n\nFormality: Informal\nUsage Notes: Very common in Colombian phone conversations to indicate current departure status."
  },
  {
    "Spanish": "Ya casi.",
    "Enhanced_Notes": "now/already\n\nCultural Context: Colombian way of saying \"almost there\" or \"almost done\" - used for time, distance, or task completion.\n\nExample 1: ¿Ya terminaste? - Ya casi. = Are you done? - Almost.\nExample 2: ¿Falta mucho? - No, ya casi llegamos. = Is it much longer? - No, we're almost there.\nExample 3: Ya casi acabo la tarea. = I'm almost done with the homework.\n\nFormality: Informal\nUsage Notes: Ubiquitous in Colombian Spanish for reassuring someone about progress or arrival."
  },
  {
    "Spanish": "Ya entendí.",
    "Enhanced_Notes": "now/already\n\nCultural Context: Expression meaning \"now I understand\" or \"got it\" - indicates comprehension has been achieved.\n\nExample 1: ¿Entiendes cómo funciona? - Sí, ya entendí. = Do you understand how it works? - Yes, I got it now.\nExample 2: Ah ya entendí lo que dices. = Ah now I understand what you're saying.\nExample 3: Ya entendí la explicación, gracias. = I understand the explanation now, thanks.\n\nFormality: Informal to Neutral\nUsage Notes: Common response in Colombian classrooms and explanations to signal comprehension."
  },
  {
    "Spanish": "Ya llegué.",
    "Enhanced_Notes": "now/already\n\nCultural Context: Announcement of arrival, very common in Colombian culture to let people know you've arrived.\n\nExample 1: Ya llegué a la casa. = I've arrived home / I'm home now.\nExample 2: Ya llegué, ¿dónde están?  = I'm here, where are you?\nExample 3: Te aviso cuando ya llegue. = I'll let you know when I arrive.\n\nFormality: Informal to Neutral\nUsage Notes: Colombians often text or call \"Ya llegué\" to confirm safe arrival, especially to family."
  },
  {
    "Spanish": "Ya no.",
    "Enhanced_Notes": "now/already\n\nCultural Context: Means \"not anymore\" or \"no longer\" - indicates a change in state or situation.\n\nExample 1: ¿Todavía vives en Bogotá? - Ya no, me mudé. = Do you still live in Bogotá? - Not anymore, I moved.\nExample 2: Ya no quiero más café. = I don't want more coffee anymore.\nExample 3: Ya no trabajo allí. = I don't work there anymore.\n\nFormality: Informal to Neutral\nUsage Notes: Common in Colombian conversations to indicate changes in habits, situations, or preferences."
  },
  {
    "Spanish": "Ya {{voy}}.",
    "Enhanced_Notes": "now/already\n\nCultural Context: Common response meaning \"I'm coming\" or \"I'm on it\" - shows action is starting or in progress.\n\nExample 1: ¡Ven acá! - Ya voy. = Come here! - I'm coming.\nExample 2: ¿Me ayudas? - Ya voy, espera. = Can you help me? - I'm coming, wait.\nExample 3: Ya voy para allá. = I'm on my way there.\n\nFormality: Informal\nUsage Notes: Very common Colombian response to calls or requests, indicating immediate action."
  },
  {
    "Spanish": "{{Acabar}} de + inf: Acabo de comer.",
    "Enhanced_Notes": "Recent past pattern\n\nCultural Context: Construction meaning \"to have just done something\" - recent past action.\n\nExample 1: Acabo de llegar a la casa. = I just arrived home.\nExample 2: Acabamos de terminar la reunión. = We just finished the meeting.\nExample 3: ¿Ya comiste? - Sí, acabo de comer. = Did you eat? - Yes, I just ate.\n\nFormality: Neutral\nUsage Notes: Pattern: acabar (conjugated) + de + infinitive. Common in Colombian Spanish to indicate very recent actions."
  },
  {
    "Spanish": "{{Dame}} un minuto.",
    "Enhanced_Notes": "Dar = to give\n\nCultural Context: Request for a short wait using imperative of \"dar\" - very common in daily interactions.\n\nExample 1: Dame un minuto, ya termino. = Give me a minute, I'm almost done.\nExample 2: Dame un segundo, ya te atiendo. = Give me a second, I'll help you.\nExample 3: Dame cinco minutos por favor. = Give me five minutes please.\n\nFormality: Informal to Neutral\nUsage Notes: Common in Colombian service contexts and casual interactions. Can also use \"damela\" for \"give it to me\"."
  },
  {
    "Spanish": "{{Dime}} algo.",
    "Enhanced_Notes": "Decir = to say/tell\n\nCultural Context: Imperative of \"decir\" meaning \"tell me something\" - used to request information or start conversation.\n\nExample 1: Dime qué pasó. = Tell me what happened.\nExample 2: Dime la verdad por favor. = Tell me the truth please.\nExample 3: Dime algo interesante. = Tell me something interesting.\n\nFormality: Informal to Neutral\nUsage Notes: Common in Colombian conversations. \"Dime\" can also mean \"tell me\" or \"what's up?\" as a greeting."
  },
  {
    "Spanish": "¿A qué hora te queda bien?",
    "Enhanced_Notes": "scheduling check\n\nCultural Context: Colombian way to ask what time works for someone - very polite and common in scheduling.\n\nExample 1: ¿A qué hora te queda bien para reunirnos? = What time works for you to meet?\nExample 2: Mañana nos vemos. ¿A qué hora te queda bien? = Let's meet tomorrow. What time works for you?\nExample 3: ¿Te queda bien a las tres? = Does three o'clock work for you?\n\nFormality: Neutral to Formal\nUsage Notes: Using \"quedar bien\" is characteristically Colombian. More polite than \"¿qué hora te conviene?\""
  },
  {
    "Spanish": "¿Quieres que pase por ti?",
    "Enhanced_Notes": "Cultural Context: Offer to pick someone up - very common in Colombian culture where giving rides is a social norm.\n\nExample 1: ¿Quieres que pase por ti a las 7? = Do you want me to pick you up at 7?\nExample 2: Voy para allá. ¿Quieres que pase por ti? = I'm going there. Want me to pick you up?\nExample 3: No te preocupes, paso por ti. = Don't worry, I'll pick you up.\n\nFormality: Informal to Neutral\nUsage Notes: Common among Colombian friends and family. Reflects the culture of mutual help and carpooling."
  }
]